app/views/models/index.html.erb

SELECT "models".* FROM "models" brand ORDER BY brand
---
  <tbody>
    <% @models.includes('brand').order('brands.name','models.name').each do |model| %>