app/views/tasks/index.html.erb

SELECT  "roles".* FROM "roles" INNER JOIN "role_users" ON "roles"."id" = "role_users"."role_id" WHERE "role_users"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 8], ["LIMIT", 1]]
---
        <td><%= task.contractor.surname + " " + task.contractor.name if task.contractor != nil%></td>
        <td><%= link_to 'Предложить свою кандидатуру', task if current_user.roles.first.name == "contractor" and task.status == ""%></td>