app/views/shared/_navbar.html.erb


            <li><%= link_to "Редактировать профиль", edit_client_path(current_user.role_users.first.us_role_id) if current_user != nil and current_user.role_users.size != 0 and current_user.roles.first.name == "client"%> </li>
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" INNER JOIN "role_users" ON "roles"."id" = "role_users"."role_id" WHERE "role_users"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "role_users" WHERE "role_users"."user_id" = $1  [["user_id", 7]]
SELECT COUNT(*) FROM "roles" INNER JOIN "role_users" ON "roles"."id" = "role_users"."role_id" WHERE "role_users"."user_id" = $1  [["user_id", 5]]