app/views/contractors/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  <strong>User:</strong>
  <%= link_to(@contractor.role_users.first.user.email, :action => :show,  :controller => :users, :id => @contractor.role_users.first.user_id) if @contractor.role_users.size != 0%>