app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @client = Client.new(client_params)
    r1 = Role.where(:name => "client").first
    if current_user.role_users.size != 0
      us_id = RoleUser.where(user_id: current_user.id).first.us_role_id
      RoleUser.delete_all(user_id: current_user.id)
      Contractor.delete_all(id: us_id)
    end
    RoleUser.create(:role => r1, :user => current_user, :us_role => @client)
---
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["name", "client"], ["LIMIT", 1]]
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT COUNT(*) FROM "role_users" WHERE "role_users"."user_id" = $1  [["user_id", 7]]
DELETE FROM "role_users" WHERE "role_users"."user_id" = $1  [["user_id", 4]]
DELETE FROM "contractors" WHERE "contractors"."id" = $1  [["id", 5]]
INSERT INTO "clients" ("surname", "name", "patronymic", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["surname", "иванов"], ["name", "иван"], ["patronymic", "иванович"], ["phone_number", "+7"], ["created_at", 2016-11-13 10:30:18 UTC], ["updated_at", 2016-11-13 10:30:18 UTC]]
INSERT INTO "role_users" ("role_id", "user_id", "us_role_type", "us_role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["role_id", 1], ["user_id", 4], ["us_role_type", "Client"], ["us_role_id", 8], ["created_at", 2016-11-23 21:00:29 UTC], ["updated_at", 2016-11-23 21:00:29 UTC]]

  def update
    respond_to do |format|
      if @client.update(client_params)
---
UPDATE "clients" SET "phone_number" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["phone_number", "+79018231632"], ["updated_at", 2016-11-13 10:30:32 UTC], ["id", 1]]

  def destroy
    @client.destroy
---
DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 8]]

    def set_client
      @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]