app/controllers/contractors_controller.rb

SELECT "contractors".* FROM "contractors"
---
  def index
    @contractors = Contractor.all

SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["name", "contractor"], ["LIMIT", 1]]
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT "roles".* FROM "roles" INNER JOIN "role_users" ON "roles"."id" = "role_users"."role_id" WHERE "role_users"."user_id" = $1  [["user_id", 4]]
DELETE FROM "role_users" WHERE "role_users"."user_id" = $1  [["user_id", 5]]
DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 5]]
INSERT INTO "contractors" ("surname", "name", "patronymic", "address", "phone_number", "info", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["surname", "1"], ["name", "1"], ["patronymic", "1"], ["address", "1"], ["phone_number", "1"], ["info", "1"], ["created_at", 2016-11-23 18:24:44 UTC], ["updated_at", 2016-11-23 18:24:44 UTC]]
INSERT INTO "role_users" ("role_id", "user_id", "us_role_type", "us_role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["role_id", 4], ["user_id", 4], ["us_role_type", "Contractor"], ["us_role_id", 7], ["created_at", 2016-11-23 18:32:41 UTC], ["updated_at", 2016-11-23 18:32:41 UTC]]
---
  def create
    @contractor = Contractor.new(contractor_params)
    r1 = Role.where(:name => "contractor").first
    if current_user.role_users.size != 0
      us_id = RoleUser.where(user_id: current_user.id).first.us_role_id
      RoleUser.delete_all(user_id: current_user.id)
      Client.delete_all(id: us_id)
    end
    RoleUser.create(:role => r1, :user => current_user, :us_role => @contractor)

DELETE FROM "contractors" WHERE "contractors"."id" = $1  [["id", 5]]
---
  def destroy
    @contractor.destroy

SELECT  "contractors".* FROM "contractors" WHERE "contractors"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_contractor
      @contractor = Contractor.find(params[:id])