app/controllers/models_controller.rb

SELECT "models".* FROM "models" brand ORDER BY brand
---
  def index
    @models = Model.all

INSERT INTO "models" ("brand_id", "name", "description", "years_of_production", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["brand_id", 0], ["name", "qq"], ["description", "qqq"], ["years_of_production", "qq"], ["created_at", 2016-11-09 20:15:10 UTC], ["updated_at", 2016-11-09 20:15:10 UTC]]
---
  def create
    @model = Model.new(model_params)

    respond_to do |format|
      if @model.save

UPDATE "models" SET "name" = $1, "description" = $2, "years_of_production" = $3, "updated_at" = $4 WHERE "models"."id" = $5  [["name", "m5"], ["description", "fast"], ["years_of_production", "1020-1320"], ["updated_at", 2016-11-09 21:14:41 UTC], ["id", 9]]
---
  def update
    respond_to do |format|
      if @model.update(model_params)

SELECT  "models".* FROM "models" WHERE "models"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_model
      @model = Model.find(params[:id])