app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)
    @task.client_id = current_user.role_users.first.us_role_id
    respond_to do |format|
      if @task.save
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("client_id", "brand_id", "model_id", "transmission", "vin", "date_start", "date_end", "price", "info", "status", "contractor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "vin" = $1, "price" = $2, "info" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["vin", "1239182391"], ["price", #<BigDecimal:7f1244a80888,'0.1E4',9(18)>], ["info", "Поменять масло в АКПП"], ["updated_at", 2016-11-30 20:09:36 UTC], ["id", 5]]

  def destroy
    @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]

    def set_task
      @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]